# pandas

In [2]:
# Author: Anuj Gaikwad
# Date: 27/05/2024

# Pandas is a tool for data processing which helps in data analysis

# It provides functions and methods o efficiently manipulate large datasets

# Data structures in Pandas
# Series ( one dimentional Array )
# Series is a one dimentional array with labels, it contains any data type including integers, strings, floats
# python objects and more

# DataFrame ( two dimentional Array )
# Dataframe is two dimentional data structure with labels, we can use labels to locate data

In [4]:
import pandas as pd

In [5]:
print(pd.__version__)

2.1.4

series - create , manipulate, querry, delete

In [8]:
# creating a series from a list
arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [9]:
order = [1,2,3,4,5]
s2  = pd.Series(arr,index = order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [13]:
import numpy as np
n = np.random.randn(5) # create a random ndarray
index = ['a','b','c','d','e']
s2 = pd.Series(n,index = index)
s2

a   -1.105931
b   -0.244794
c   -0.876408
d    0.950518
e   -0.315589
dtype: float64

In [14]:
#create a series from a dictionary
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
s3 = pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [16]:
# you can modify the index of series
print(s1)
s1.index = ['A','B','C','D','E']
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [21]:
# slicing
a = s1[:3]
a

A    0
B    1
C    2
dtype: int64

In [23]:
s4 = s1._append(s3)
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
s4.drop('e')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

In [25]:
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

# series Operations

In [26]:
arr1 = [0,1,2,3,4,5,7]
arr2 = [6,7,8,9,5]

In [27]:
s5 = pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [28]:
s6 = pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [29]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [30]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [31]:
s5.mul(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [32]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [34]:
print('median',s6.median())
print('max',s6.max())
print('min',s6.min())

median 3.0
max 7
min 0

In [35]:
s7 = s5.mul(s6)

In [36]:
print('median',s7.median())
print('max',s7.max())
print('min',s7.min())

median 16.0
max 27.0
min 0.0

# create a Dataframe

In [39]:
# Define time sequence as index
dates = pd.date_range('today',periods = 6)
dates

DatetimeIndex(['2024-05-24 15:19:24.071370', '2024-05-25 15:19:24.071370',
               '2024-05-26 15:19:24.071370', '2024-05-27 15:19:24.071370',
               '2024-05-28 15:19:24.071370', '2024-05-29 15:19:24.071370'],
              dtype='datetime64[ns]', freq='D')

In [41]:
num_arr = np.random.randn(6,4)
num_arr

array([[-0.66124512,  1.05431571,  1.55958894,  1.26333496],
       [-1.02921091,  1.20601492,  0.99998415, -0.66850641],
       [-0.40087349,  0.87571396, -0.78550208, -0.0358597 ],
       [ 0.7983155 , -0.58674917,  0.45478605,  0.99232995],
       [-0.81682623,  0.89047663, -0.70061938, -0.35838806],
       [-2.39400224,  0.94582532, -1.03256606, -2.07541658]])

In [42]:
columns = ['A','B','C','D']
columns

['A', 'B', 'C', 'D']

In [43]:
df1 = pd.DataFrame(num_arr, index = dates, columns = columns)
df1

                                   A         B         C         D
2024-05-24 15:19:24.071370 -0.661245  1.054316  1.559589  1.263335
2024-05-25 15:19:24.071370 -1.029211  1.206015  0.999984 -0.668506
2024-05-26 15:19:24.071370 -0.400873  0.875714 -0.785502 -0.035860
2024-05-27 15:19:24.071370  0.798315 -0.586749  0.454786  0.992330
2024-05-28 15:19:24.071370 -0.816826  0.890477 -0.700619 -0.358388
2024-05-29 15:19:24.071370 -2.394002  0.945825 -1.032566 -2.075417

In [44]:
# create dataframe with dictionary array

data = { 'animal':['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
        'age':[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
        'visits':[1,3,2,3,2,3,1,1,2,1],
        'priority':['yes','yes','no','yes','no','no','no','yes','no','no']}
labels = ['a','b','c','d','e','f','g','h','i','j']

df2 = pd.DataFrame(data,index = labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [45]:
# see datatypes of array
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [46]:
df2.head(5)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [49]:
df2.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [52]:
df2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [53]:
df2.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [54]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 2, 'no'],
       ['cat', 2.0, 3, 'no'],
       ['snake', 4.5, 1, 'no'],
       ['cat', nan, 1, 'yes'],
       ['dog', 7.0, 2, 'no'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [55]:
df2.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [56]:
df2.T

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5  3.0    0.5  NaN  5.0  2.0    4.5  NaN  7.0  3.0
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no  yes   no   no     no  yes   no   no

In [58]:
df2.sort_values(by = 'age')

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [60]:
# slicing DataFrame
df2[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [61]:
df2.sort_values(by = 'age')[1:3]

  animal  age  visits priority
f    cat  2.0       3       no
a    cat  2.5       1      yes

In [62]:
#query dataframe by tag
df2[[ 'age' , 'visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [63]:
# Query rows 2, 3
df2.iloc[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [64]:
df3 = df2.copy()
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [65]:
df3.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [66]:
df3.loc['f','age'] = 1.5
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [84]:
df3[['age','visits']].mean()

age       3.375
visits    1.900
dtype: float64

In [82]:
df3['visits'].sum()

19

In [85]:
df3.sum()

animal      catcatsnakedogdogcatsnakecatdogdog
age                                       27.0
visits                                      19
priority              yesyesnoyesnononoyesnono
dtype: object

In [87]:
string = pd.Series(['A','C','D','BaCa',np.nan,'CBA','cow','owl'])
string

0       A
1       C
2       D
3    BaCa
4     NaN
5     CBA
6     cow
7     owl
dtype: object

In [88]:
string = pd.Series(['A','C','D','BaCa',np.nan,'CBA','cow','owl'])
string.str.lower()

0       a
1       c
2       d
3    baca
4     NaN
5     cba
6     cow
7     owl
dtype: object

In [89]:
string = pd.Series(['A','C','D','BaCa',np.nan,'CBA','cow','owl'])
string.str.upper()

0       A
1       C
2       D
3    BACA
4     NaN
5     CBA
6     COW
7     OWL
dtype: object

# Operations for DataFrame missing values

In [93]:
df4 = df3.copy()
df4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [91]:
df4.fillna(4)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [92]:
meanAge = df4['age'].mean()
df4['age'].fillna(meanAge)

a    2.500
b    3.000
c    0.500
d    3.375
e    5.000
f    1.500
g    4.500
h    3.375
i    7.000
j    3.000
Name: age, dtype: float64

In [94]:
df4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [95]:
df5 = df3.copy()
df5.dropna(how = 'any')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

# DataFrame file operations

In [97]:
df3.to_csv('animal.csv')

In [98]:
df3_animal = pd.read_csv('animal.csv')
df3_animal.head(5)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no
3          d    dog  NaN       3      yes
4          e    dog  5.0       2       no

In [100]:
df3.to_excel('animal.xlsx',sheet_name = 'sheet1')
df_animal2 = pd.read_excel('animal.xlsx','sheet1',index_col = None, na_values = ['NA'])
df_animal2

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no
3          d    dog  NaN       3      yes
4          e    dog  5.0       2       no
5          f    cat  1.5       3       no
6          g  snake  4.5       1       no
7          h    cat  NaN       1      yes
8          i    dog  7.0       2       no
9          j    dog  3.0       1       no